In [9]:
import pandas as pd
df_movies = pd.read_csv('IMDb movies.csv',low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [10]:
# select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year',
                       'genre', 'country', 'director', 'actors']]

df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# concat()
# Concatenate horizontally
To concatenate horizontally (along the columns) we should have a common index between the 2 dataframes

In [11]:
df1 = pd.DataFrame({'id':['A','B','C','D'],
                    'age':[30,22,11,55]})
df2 = pd.DataFrame({'job':['Doctor','Statistician','Accountant','Developer']})

In [14]:
df1

  id  age
0  A   30
1  B   22
2  C   11
3  D   55

In [15]:
df2

            job
0        Doctor
1  Statistician
2    Accountant
3     Developer

In [17]:
pd.concat([df1,df2])

    id   age           job
0    A  30.0           NaN
1    B  22.0           NaN
2    C  11.0           NaN
3    D  55.0           NaN
0  NaN   NaN        Doctor
1  NaN   NaN  Statistician
2  NaN   NaN    Accountant
3  NaN   NaN     Developer

In [16]:
pd.concat([df1,df2],axis=1)

  id  age           job
0  A   30        Doctor
1  B   22  Statistician
2  C   11    Accountant
3  D   55     Developer

# Exercise

In [18]:
# shape of dataframes that we'll concatenate
print(df_movies.shape)
print(df_ratings.shape)

(85855, 7)
(85855, 3)

In [22]:
# concatenate df_movies and df_ratings on 'imdb_title_id' (horizontally along the columns)
df_concat = pd.concat([df_movies,df_ratings],axis=1)

In [23]:
# shape of concatenation
df_concat.shape

(85855, 10)